app/views/exhibitorcategories/show.html.erb

<b>Show Exhibitors</b><br />
  <% @exhibitorcategory.exhibitors.each do |ec| %>
---
SELECT "exhibitors".* FROM "exhibitors" WHERE "exhibitors"."exhibitorcategory_id" = 1