app/views/meetings/_form.html.erb

SELECT "venues".* FROM "venues"
---
    <%= f.label :venue %><br />
    <%= f.select :venue_id, Venue.all.map{ |v| [v.name, v.id]} %>

SELECT "sponsors".* FROM "sponsors"
SELECT 1 AS one FROM "sponsors" INNER JOIN "meetings_sponsors" ON "sponsors"."id" = "meetings_sponsors"."sponsor_id" WHERE "meetings_sponsors"."meeting_id" IS NULL AND "sponsors"."id" = 1 LIMIT 1
---
        <div>
        <%= check_box_tag "meeting[sponsor_ids][]", c.id, @meeting.sponsors.include?(c) %>