app/views/meetings/show.html.erb

SELECT "sponsors".* FROM "sponsors" INNER JOIN "meetings_sponsors" ON "sponsors"."id" = "meetings_sponsors"."sponsor_id" WHERE "meetings_sponsors"."meeting_id" = 1
---
  <b>Sponsors</b><br />
  <% @meeting.sponsors.each do |s| %>