app/views/exhibitors/_form.html.erb

    <%= f.label :exhibitor_category_name %><br />
    <%= f.select :exhibitorcategory_id, Exhibitorcategory.all.map{ |ec| [ec.name, ec.id]} %>
---
SELECT "exhibitorcategories".* FROM "exhibitorcategories"

    <%= f.label :is_a_sponsor %><br />
    <%= f.collection_select :sponsor_id, Sponsor.all, 'id', 'name', :prompt => "I am not a sponsor" %><br />
---
SELECT "sponsors".* FROM "sponsors"