app/views/venues/show.html.erb

SELECT "meetings".* FROM "meetings" WHERE "meetings"."venue_id" = 1
---
  <b>Meetings Scheduled:</b><br />
  <% @venue.meetings.each do |m| %>