app/controllers/exhibitors_controller.rb

  def index
    @exhibitors = Exhibitor.all
---
SELECT "exhibitors".* FROM "exhibitors"

  def show
    @exhibitor = Exhibitor.find(params[:id])
---
SELECT "exhibitors".* FROM "exhibitors" WHERE "exhibitors"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @exhibitor = Exhibitor.find(params[:id])
---
SELECT "exhibitors".* FROM "exhibitors" WHERE "exhibitors"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @exhibitor = Exhibitor.new(params[:exhibitor])

    respond_to do |format|
      if @exhibitor.save
---
INSERT INTO "exhibitors" ("created_at", "description", "exhibitor_category_id", "name", "sponsor_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @exhibitor = Exhibitor.find(params[:id])
---
SELECT "exhibitors".* FROM "exhibitors" WHERE "exhibitors"."id" = ? LIMIT 1  [["id", "1"]]