app/controllers/exhibitorcategories_controller.rb

  def index
    @exhibitorcategories = Exhibitorcategory.all
---
SELECT "exhibitorcategories".* FROM "exhibitorcategories"

  def show
    @exhibitorcategory = Exhibitorcategory.find(params[:id])
---
SELECT "exhibitorcategories".* FROM "exhibitorcategories" WHERE "exhibitorcategories"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @exhibitorcategory = Exhibitorcategory.find(params[:id])
---
SELECT "exhibitorcategories".* FROM "exhibitorcategories" WHERE "exhibitorcategories"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @exhibitorcategory = Exhibitorcategory.new(params[:exhibitorcategory])

    respond_to do |format|
      if @exhibitorcategory.save
---
INSERT INTO "exhibitorcategories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 30 Jan 2013 23:01:06 UTC +00:00], ["name", "Science"], ["updated_at", Wed, 30 Jan 2013 23:01:06 UTC +00:00]]