app/controllers/meetings_controller.rb

SELECT "meetings".* FROM "meetings"
---
  def index
    @meetings = Meeting.all

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @meeting = Meeting.find(params[:id])

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @meeting = Meeting.find(params[:id])

INSERT INTO "meetings" ("created_at", "end_date", "name", "sponsor_id", "start_date", "updated_at", "venue_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    params[:meeting][:sponsor_ids] ||= []
    @meeting = Meeting.new(params[:meeting])

    respond_to do |format|
      if @meeting.save

SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def destroy
    @meeting = Meeting.find(params[:id])